<?php

return [
    'welcome' => 'مرحباً بكم في تطبيقنا!',
    'success' => 'تمت العملية بنجاح.',
    'error' => 'حدث خطأ. يرجى المحاولة لاحقاً.',
    'true' => 'صحيح.',
    'user_created' => 'تم إنشاء المستخدم بنجاح.',
    'user_deleted' => 'تم حذف المستخدم.',
    'invalid_credentials' => 'البريد الالكتروني أو كلمة المرور غير صحيحة.',
    'unauthorized' => 'ليس لديك صلاحية لتنفيذ هذا الإجراء.',
    'login_success' => 'تم تسجيل الدخول بنجاح، أهلاً بك!',
    'otp_sent' => 'تم إرسال رمز التحقق (OTP) إلى بريدك الالكتروني، يرجى التحقق منه.',
    'otp_send_failed' => 'حدث خطأ أثناء إرسال رمز التحقق (OTP). يرجى المحاولة لاحقاً.',
    'otp_verified' => 'تم التحقق من رمز التحقق (OTP) بنجاح.',
    'invalid_or_expired_otp' => 'رمز التحقق (OTP) غير صالح أو منتهي الصلاحية.',
    'registration_failed' => 'فشل التسجيل. يرجى المحاولة مرة أخرى.',

];
